Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: quarkus.oidc-client-graphql.client-name=oidc-client-for-graphql # example declaration of the OIDC client itself quarkus.oidc-client.oidc-client-for-graphql.auth-server-url=${keycloak.url} quarkus.oidc-client.oidc-client-for-graphql.grant.type=password quarkus.oidc-client.oidc-client-for-graphql.grant-options.password.username=${username} quarkus.oidc-client.oidc-client-for-graphql.grant-options.password.password=${password} quarkus.oidc-client.oidc-client-for-graphql.client-id=${quarkus.oidc.client-id} quarkus.oidc-client.oidc-client-for-graphql.credentials.client-secret.value=${keycloak.credentials.secret} quarkus.oidc-client.oidc-client-for-graphql.credentials.client-secret.method=POST
ja_jp: quarkus.oidc-client-graphql.client-name=oidc-client-for-graphql # OIDC クライアント自体の宣言例 quarkus.oidc-client.oidc-client-for-graphql.auth-server-url=${keycloak.url} quarkus.oidc-client.oidc-client-for-graphql.grant.type=password quarkus.oidc-client.oidc-client-for-graphql.grant-options.password.username=${username} quarkus.oidc-client.oidc-client-for-graphql.grant-options.password.password=${password} quarkus.oidc-client.oidc-client-for-graphql.client-id=${quarkus.oidc.client-id} quarkus.oidc-client.oidc-client-for-graphql.credentials.client-secret.value=${keycloak.credentials.secret} quarkus.oidc-client.oidc-client-for-graphql.credentials.client-secret.method=POST

source: quarkus.oidc.token.principal-claim
ja_jp: `quarkus.oidc.token.principal-claim` を使用して、プリンシパル名を取得するための Java Security `Principal` および MicroProfile JWT `JsonWebToken` API をサポートするためにどのトークンクレームを使用するかをカスタマイズできます。デフォルトでは `upn`、 `preferred_username`、 `sub` などのクレームがプリンシパル名の検索に使用されますが、一部のトークンでは `name` やその他のクレームに含まれている場合があり、その場合に `quarkus.oidc.token.principal-claim=name` などと設定できます。

source: quarkus.test.exclude-module-pattern (ignored if `include-module-pattern` has been set) - a regular expression and is matched against the module groupId:artifactId, tests from the matched modules will be excluded from the continuous testing.
ja_jp: quarkus.test.exclude-module-pattern ( `include-module-pattern` が設定されている場合は無視されます) - モジュールの groupId:artifactId と照合される正規表現で、一致したモジュールのテストは継続的テストから除外されます。

source: quarkus.test.include-module-pattern - a regular expression matched against the module groupId:artifactId, tests from the matched modules will be included in the continuous testing;
ja_jp: quarkus.test.include-module-pattern - モジュールの groupId:artifactId と照合される正規表現で、一致したモジュールのテストが継続的テストの対象となります。

source: quarkus.test.only-test-application-module (default value is false) - if false then tests from all dependency modules will be run as well;
ja_jp: quarkus.test.only-test-application-module (デフォルト値は false) - false の場合、依存関係にあるすべてのモジュールのテストも実行されます。

source: quarkus:dev Output
ja_jp: quarkus:dev 出力

source: qui-alert - Show an alert.
ja_jp: qui-alert - アラートを表示します。

source: qui-badge - Badge component.
ja_jp: qui-badge - バッジコンポーネント。

source: qui-card - Card component.
ja_jp: qui-card - カードコンポーネント。

source: qui-code-block - Render code. (See below *Code block* section)
ja_jp: qui-code-block - コードをレンダリングします。(下記「*コードブロック*」セクションを参照)

source: qui-directory-tree - Render a directory tree (like in the workspace).
ja_jp: qui-directory-tree - ディレクトリツリーをレンダリングします (ワークスペース内など)。

source: qui-dot - Render dot files.
ja_jp: qui-dot - dot ファイルをレンダリングします。

source: qui-switch - Switch button.
ja_jp: qui-switch - スイッチボタン。

source: quickly visualize all the extensions currently loaded
ja_jp: 現在ロードされているすべてのエクステンションを素早く視覚化

source: raw: This will be used as is (text)
ja_jp: raw: これはそのまま (テキストとして) 使用されます

source: ready: Assistant is configured and ready to use.
ja_jp: ready: アシスタントが設定され、使用可能な状態です。

source: redis
ja_jp: レディス

source: register a CRaC Resource doing the initialization
ja_jp: 初期化を行うCRaC Resourceを登録する

source: releases the thread.
ja_jp: スレッドを解放します。

source: remain focused on describing their topic. They don't explain or provide additional context from other sources.
ja_jp: 自分のトピックを説明することに焦点を当てています。他のソースからのコンセプトを説明することはありません。

source: replace: Content will replace the original (input) content
ja_jp: replace: 内容が元の (入力) 内容を置き換えます

source: request cohort
ja_jp: リクエストコホート

source: request priority
ja_jp: リクエストの優先度

source: request/reply - send the message and expect a response. The receiver can respond to the message in an asynchronous fashion.
ja_jp: request/reply - メッセージを送信し、応答を期待します。受信者は非同期的にメッセージに応答することができます。

source: request/reply - send the message and expect a response. The receiver can respond to the message in an asynchronous-fashion
ja_jp: request/reply - メッセージを送信し、応答を待ちます。受信者は非同期的にメッセージに応答することができます。

source: returning `MyEntity` will automatically make the endpoint blocking
ja_jp: `MyEntity` を返すと、エンドポイントは自動的にブロッキング化されます。

source: returning `Uni<MyEntity>` will make it reactive
ja_jp: `Uni<MyEntity>` を返すと、リアクティブになる

source: runtime Quarkus extension artifact ID, in our example `quarkus-extension-a`
ja_jp: ランタイムQuarkusエクステンションアーティファクトID、この例では `quarkus-extension-a`

source: runtime Quarkus extension artifact ID, in our example `quarkus-extension-b`;
ja_jp: ランタイムQuarkusエクステンションアーティファクトID。この例では `quarkus-extension-b` 。

source: runtime Quarkus extension artifact ID;
ja_jp: ランタイム Quarkus エクステンションアーティファクト ID。

source: same name as the username
ja_jp: ユーザー名と同じ名前

source: save the file
ja_jp: ファイルの保存

source: scaffold a project in a single command line
ja_jp: 単一のコマンドラインでプロジェクトの雛形を生成する方法

source: scheduler
ja_jp: スケジューラー

source: schedules the operation,
ja_jp: 操作をスケジュールします、

source: schema
ja_jp: スキーマ

source: search - `.search()` (requires the https://redis.com/modules/redis-search/[RedisSearch] module on the server side).
ja_jp: search - `.search()` (サーバー側に link:https://redis.com/modules/redis-search/[RedisSearch] モジュールが必要です)。

source: search for authors or book titles (we initialized some data for you)
ja_jp: 著者や書名の検索してください（いくつかのデータを入れておきました）

source: see xref:kafka-schema-registry-avro.adoc[Using Apache Kafka with Schema Registry and Avro] for more information about using Confluent or Apicurio Registry libraries
ja_jp: Confluent または Apicurio Registry ライブラリーの使用に関する詳細は、 xref:kafka-schema-registry-avro.adoc[Schema RegistryとAvroと共にApache Kafkaを使用] を参照してください

source: select Decision Table as the decision logic for the node.
ja_jp: ノードの意思決定ロジックとして Decision Table を選択します。

source: select the Edit decision logic option for the node `Base price`.
ja_jp: `Base price` ノードの編集オプションを選択します。

source: select the thread we want to inspect, e.g. thread 1:
ja_jp: 検査するスレッドを選択します (例: スレッド 1)。

source: send the `name` to the `greeting` address and request a response
ja_jp: `greeting` アドレスに `name` を送信し、レスポンスを要求します。

source: sending email when the endpoint receives an HTTP request.
ja_jp: エンドポイントがHTTPリクエストを受信したときにメールを送信

source: sent as `HTTPOnly` cookie to the client, and
ja_jp: `HTTPOnly` のCookieとしてクライアントに送信され、

source: server-config-override.xml is a file under the resources folder
ja_jp: server-config-override.xmlは、resourcesフォルダの下にあるファイルです

source: service
ja_jp: サービス

source: service discovery - it lets you locate the service you need to call;
ja_jp: サービスディスカバリー - 呼び出す必要のあるサービスを見つけることを可能とします。

source: service selection - it lets you select the right one when there is more than one instance
ja_jp: サービス選択 - 複数のインスタンスがある場合、適切なものを選択することを可能とします。

source: set `attachRunnerAsMainArtifact` parameter of the `quarkus:build` goal to `true`.
ja_jp: `quarkus:build` ゴールの `attachRunnerAsMainArtifact` パラメータを `true` に設定する。

source: set `quarkus.package.add-runner-suffix=false`, which will disable the addition of the file name suffix and, by doing that, will replace the original project JAR on the file system;
ja_jp: `quarkus.package.add-runner-suffix=false` をセットする。これは、ファイル名のサフィックスの追加を無効にし、ファイルシステム上のオリジナル・プロジェクトJARを置き換える；

source: set `quarkus.package.jar.add-runner-suffix=false`, which will disable the addition of the file name suffix and, by doing that, will replace the original project JAR on the file system;
ja_jp: `quarkus.package.jar.add-runner-suffix=false` を設定します。これは、ファイル名の接尾辞の追加を無効にし、ファイルシステム上の元のプロジェクトJARを置き換えます；

source: set `use-anonymous-sender` to false
ja_jp: `use-anonymous-sender` を false に設定します

source: set the destination address (anonymous sender are not supported)
ja_jp: 宛先アドレスの設定 (匿名送信はサポートされていません)

source: simplified dependency management;
ja_jp: 依存関係管理の簡素化;

source: small (based on `ubi8-micro`)
ja_jp: 軽量（ `ubi8-micro` に基づきます）

source: small (based on `ubi9-micro`)
ja_jp: 小さい ( `ubi9-micro` に基づく)

source: split: Content will display in a split screen (left/right)
ja_jp: split: 内容が分割画面 (左/右) に表示されます

source: start Infinispan server
ja_jp: Infinispan サーバーを起動する

source: start Quarkus with:
ja_jp: Quarkusを起動します。

source: start event
ja_jp: スタートイベント

source: start your Quarkus application with:
ja_jp: 次のようにQuarkusアプリケーションを起動します:

source: starts with `#`, followed by the name of the section such as `{#if}` and `{#each}`,
ja_jp: `#` で始まり、 `{#if}` や `{#each}` などのセクションの名前が続きます。

source: static (known at build time) `.staticLabel("staticLabelValue")`
ja_jp: 静的 (ビルド時に既知のラベル) `.staticLabel("staticLabelValue")`

source: str: create dynamic strings with variables
ja_jp: str: 変数を含む動的文字列を作成

source: stream (not available yet)
ja_jp: ストリーム (まだ利用できません)

source: stream may also be hot/cold in “reactive streams” terminology
ja_jp: “リアクティブストリーム“ の用語では、ストリームはホット/コールドでも問題ない

source: streaming (continuously streaming updated values at runtime) `.streamingLabelJsonRPCMethodName("yourJsonRPCMethodName")`
ja_jp: ストリーミング (実行時に更新される値の継続的なストリーミング)値を継続的にストリーミング `.streamingLabelJsonRPCMethodName("yourJsonRPCMethodName")`

source: subscribers may act upon the data store, by acting upon the fact handle
ja_jp: サブスクライバーはファクトハンドルを操作してデータストアを操作できる。

source: subscribers only receive new (and possibly past) messages
ja_jp: サブスクライバーは新しいメッセージ (および過去のメッセージ) のみを受信します

source: subscription commands (`SUBSCRIBE`, `UNSUBSCRIBE` etc.)
ja_jp: サブスクリプションコマンド (`SUBSCRIBE`、 `UNSUBSCRIBE` など)

source: support upx-compressed executables (more details on the xref:upx.adoc[enabling compression documentation])
ja_jp: upx圧縮された実行可能ファイルのサポート（詳細は link:upx.html[圧縮の有効化についてのドキュメント]を参照してください）

source: supports consuming gRPC services
ja_jp: gRPC サービスの利用をサポートしています

source: supports https://grpc.github.io/grpc-java/javadoc/io/grpc/inprocess/InProcessServerBuilder.html[InProcess] gRPC development
ja_jp: https://grpc.github.io/grpc-java/javadoc/io/grpc/inprocess/InProcessServerBuilder.html[インプロセス] gRPC 開発をサポートします

source: supports https://grpc.github.io/grpc/core/md_doc_grpc_xds_features.html[xDS gRPC] integration
ja_jp: https://grpc.github.io/grpc/core/md_doc_grpc_xds_features.html[xDS gRPC] インテグレーションをサポート

source: supports implementing gRPC services
ja_jp: gRPCサービスの実装をサポートしています

source: switch to a worker thread (annotate `hello` endpoint with `@Blocking`)
ja_jp: ワーカスレッドに切り替える ( `hello` のエンドポイントに `@Blocking` のアノテーションを付ける)

source: synchronous
ja_jp: 同期

source: tag ends with `/`, ie. `{#emptySection /}`
ja_jp: タグは `/` で終わります。例: `{#emptySection /}`

source: tasks
ja_jp: タスク

source: test resources are global, even if they are defined on a test class or custom profile, which means they will all be activated for all tests, even though we do remove duplicates. If you want to only enable a test resource on a single test class or test profile, you can use `@QuarkusTestResource(restrictToAnnotatedClass = true)`.
ja_jp: テスト リソースは、テスト クラスまたはカスタム プロファイルで定義されている場合でもグローバルです。つまり、重複を削除しても、すべてのテストがすべてアクティブ化されます。 単一のテストクラスまたはテストプロファイルでのみテストリソースを有効にしたい場合は、 `@QuarkusTestResource(restrictToAnnotatedClass = true)` を使用します。

source: that this tutorial will take roughly 30 minutes
ja_jp: このチュートリアルの所要時間が約 30 分であること。

source: that without the channel, the remaining channels still work correctly.
ja_jp: このチャネルがなくても、残りのチャネルが引き続き正常に動作すること。

source: that you need an IDE, JDK (with versions), maven (with a placeholder for the maven version), a working container runtime, and (optionally) the Quarkus CLI.
ja_jp: IDE、JDK (バージョンを含む)、maven (maven バージョンのプレースホルダーを含む)、動作するコンテナーランタイム、および (オプションで) Quarkus CLI が必要であること。

source: the Agroal connection pooling extension (`quarkus-agroal`),
ja_jp: Agroalコネクションプールエクステンション ( `quarkus-agroal` )、

source: the Amazon Services extension (`quarkus-amazon-*`),
ja_jp: Amazon Services エクステンション(`quarkus-amazon-*`),

source: the Blaze-Persistence extension: `com.blazebit:blaze-persistence-integration-quarkus-3`
ja_jp: Blaze-Persistence エクステンション： `com.blazebit:blaze-persistence-integration-quarkus-3`

source: the Blaze-Persistence extension: `com.blazebit:blaze-persistence-integration-quarkus`
ja_jp: Blaze-Persistence エクステンション: `com.blazebit:blaze-persistence-integration-quarkus`

source: the Cassandra client extensions (`cassandra-quarkus-client`)
ja_jp: Cassandraクライアントエクステンション ( `cassandra-quarkus-client` ) 、

source: the Consul Config extension (`quarkus-config-consul`),
ja_jp: Consul Config エクステンション(`quarkus-consul-config`),

source: the Dev Services for OIDC are enabled by default if Docker and Podman are not available.
ja_jp: Docker と Podman が利用できない場合は、OIDC の開発サービスがデフォルトで有効になります。

source: the Elasticsearch client extensions (`quarkus-elasticsearch-rest-client` and `quarkus-elasticsearch-java-client`) and thus the Hibernate Search Elasticsearch extension (`quarkus-hibernate-search-orm-elasticsearch`),
ja_jp: Elasticsearch クライアントエクステンション ( `quarkus-elasticsearch-rest-client` と `quarkus-elasticsearch-java-client` ) と、Hibernate Search Elasticsearch 拡張 ( `quarkus-hibernate-search-orm-elasticsearch` ) 、

source: the Elasticsearch client extensions (`quarkus-elasticsearch-rest-client` and `quarkus-elasticsearch-rest-high-level-client`) and thus the Hibernate Search Elasticsearch extension (`quarkus-hibernate-search-orm-elasticsearch`),
ja_jp: Elasticsearch client エクステンション(`quarkus-elasticsearch-rest-client` and `quarkus-elasticsearch-rest-high-level-client`) と Hibernate Search Elasticsearch エクステンション(`quarkus-hibernate-search-orm-elasticsearch`),

source: the Elytron Security OAuth2 extension (`quarkus-elytron-security-oauth2`),
ja_jp: Elytron Security OAuth2 エクステンション(`quarkus-elytron-security-oauth2`),

source: the Flyway extension
ja_jp: Flyway エクステンション

source: the HTTP method returns a `Uni`. If you are using Quarkus REST, `Uni` support is built-in. If you are using _classic_ RESTEasy, you need to add the `quarkus resteasy-mutiny` extension to your project.
ja_jp: HTTP メソッドは `Uni` を返します。 Quarkus REST を使用している場合は、 `Uni` のサポートが組み込まれています。 _従来の_ RESTEasy を使用している場合は、 `quarkus resteasy-mutiny` エクステンションをプロジェクトに追加する必要があります。

source: the HTTP method returns a `Uni`. If you are using RESTEasy Reactive, `Uni` support is built-in. If you are using _classic_ RESTEasy, you need to add the `quarkus resteasy-mutiny` extension to your project.
ja_jp: HTTP メソッドは `Uni` を返します。RESTEasy Reactive を使用している場合は、 `Uni` のサポートが組み込まれています。 _従来の_ RESTEasyを使用している場合は、 `quarkus resteasy-mutiny` エクステンションをプロジェクトに追加する必要があります。

source: the Hibernate ORM extension: `io.quarkus:quarkus-hibernate-orm`
ja_jp: Hibernate ORM エクステンション: `io.quarkus:quarkus-hibernate-orm`

source: the Hibernate ORM with Panache extension
ja_jp: Hibernate ORM with Panache エクステンション

source: the Hibernate Reactive extension: `io.quarkus:quarkus-hibernate-reactive`
ja_jp: Hibernate Reactive エクステンション: `io.quarkus:quarkus-hibernate-reactive`

source: the Hibernate Reactive with Panache extension
ja_jp: Hibernate Reactive with Panache エクステンション

source: the Infinispan Client extension (`quarkus-infinispan-client`).
ja_jp: Infinispan クライアントエクステンション ( `quarkus-infinispan-client` )、

source: the JGit extension (`quarkus-jgit`),
ja_jp: JGit エクステンション ( `quarkus-jgit` )、

source: the JIT compiler consumes resources that could be utilized by the application.
ja_jp: JIT コンパイラは、アプリケーションが利用できるリソースを消費します。

source: the JSch extension (`quarkus-jsch`),
ja_jp: JSch エクステンション(`quarkus-jsch`),

source: the JVM has to retain a lot more metadata and compiler/profiler data to support the better optimizations that it can offer.
ja_jp: JVMは、より良い最適化をサポートするために、より多くのメタデータやコンパイラ/プロファイラのデータを保持しなければなりません。

source: the Jaeger extension (`quarkus-jaeger`),
ja_jp: Jaeger エクステンション ( `quarkus-jaeger` )、

source: the Kafka Client extension (`quarkus-kafka-client`), if Apicurio Registry 2.x Avro library is used
ja_jp: Apicurio Registry 2.xのAvroライブラリが使用されている場合、Kafka Client エクステンション( `quarkus-kafka-client`),

source: the Keycloak Authorization extension (`quarkus-keycloak-authorization`),
ja_jp: Keycloak Authorization エクステンション(`quarkus-keycloak-authorization`),

source: the Kubernetes client extension (`quarkus-kubernetes-client`),
ja_jp: Kubernetes クライアントエクステンション ( `quarkus-kubernetes-client` ),

source: the Liquibase MongoDB extension
ja_jp: Liquibase MongoDB エクステンション

source: the Liquibase extension
ja_jp: Liquibaseエクステンション

source: the Logging Sentry extension (`quarkus-logging-sentry`),
ja_jp: Logging Sentry エクステンション(`quarkus-logging-sentry`),

source: the Mailer extension (`quarkus-mailer`),
ja_jp: Mailer エクステンション ( `quarkus-mailer` ),

source: the MariaDB/MySQL support is now in a separate dependency, MariaDB/MySQL users need to add the `flyway-mysql` dependency from now on.
ja_jp: MariaDB/MySQLのサポートが別の依存関係になったため、MariaDB/MySQLのユーザーは今後、 `flyway-mysql` の依存関係を追加する必要があります。

source: the Maven structure
ja_jp: Maven の構造

source: the Microsoft SQL Server support is now in a separate dependency, Microsoft SQL Server users need to add the `flyway-sqlserver` dependency from now on.
ja_jp: Microsoft SQL Serverのサポートが別の依存関係になったため、Microsoft SQL Serverのユーザーは今後、 `flyway-sqlserver` の依存関係を追加する必要があります。

source: the MongoDB client extension
ja_jp: MongoDBクライアントエクステンション

source: the MongoDB client extension (`quarkus-mongodb-client`),
ja_jp: MongoDB client エクステンション(`quarkus-mongodb-client`),

source: the Mutiny client (`io.vertx.mutiny.ext.mail.MailClient`)
ja_jp: Mutinyクライアント (`io.vertx.mutiny.ext.mail.MailClient`)

source: the Neo4j extension (`quarkus-neo4j`),
ja_jp: Neo4j エクステンション ( `quarkus-neo4j` ),

source: the OIDC and OIDC client extensions (`quarkus-oidc` and `quarkus-oidc-client`),
ja_jp: OIDC とOIDC client エクステンション(`quarkus-oidc` and `quarkus-oidc-client`),

source: the Oracle support is now in a separate dependency, Oracle users need to add the `flyway-database-oracle` dependency from now on.
ja_jp: オラクルのサポートが別の依存関係になったため、オラクルユーザーは今後、 `flyway-database-oracle` の依存関係を追加する必要があります。

source: the PostgreSQL JDBC driver,
ja_jp: PostgreSQL JDBCドライバー,

source: the Quarkus Gradle plugin
ja_jp: Quarkus Gradle プラグイン

source: the REST Client
ja_jp: RESTクライアント

source: the REST Client Reactive extension (`quarkus-rest-client-reactive`),
ja_jp: REST Client Reactive エクステンション(`quarkus-rest-client-reactive`),

source: the REST Client extension (`quarkus-rest-client`),
ja_jp: REST Client エクステンション(`quarkus-rest-client`),

source: the REST client stub is injected with the `@RestClient` annotation.
ja_jp: REST クライアントスタブには `@RestClient` アノテーションが注入されます。

source: the RESTEasy Classic REST Client extension (`quarkus-resteasy-client`),
ja_jp: RESTEasy Classic REST クライアントエクステンション (`quarkus-resteasy-client`),

source: the Reactive REST Client
ja_jp: リアクティブRESTクライアント

source: the Reactive client for IBM DB2 extension (`quarkus-reactive-db2-client`),
ja_jp: IBM DB2 エクステンションのReactiveクライアント(`quarkus-reactive-db2-client`),

source: the Reactive client for Microsoft SQL Server extension (`quarkus-reactive-mssql-client`),
ja_jp: Reactive client for Microsoft SQL Server エクステンション(`quarkus-reactive-mssql-client`),

source: the Reactive client for MySQL extension (`quarkus-reactive-mysql-client`),
ja_jp: MySQL エクステンションの Reactive クライアント ( `quarkus-reactive-mysql-client` ),

source: the Reactive client for PostgreSQL extension (`quarkus-reactive-pg-client`),
ja_jp: PostgreSQLエクステンションのReactiveクライアント ( `quarkus-reactive-pg-client` ) ,

source: the Redis client extension (`quarkus-redis-client`),
ja_jp: Redis クライアントエクステンション ( `quarkus-redis-client` ),

source: the Redis key is built as follows: `cache:$cache-name:$cache-key`, where `cache-key` is the key the application uses.
ja_jp: Redisキーは次のように構築されます: `cache:$cache-name:$cache-key` 。ここで、 `cache-key` はアプリケーションが使用するキーです。

source: the Redis key is built as follows: `cache:{cache-name}:{cache-key}`, where `cache-key` is the key the application uses and `cache:{cache-name}` the prefix.
ja_jp: Redisのキーは以下のように構築されます： `cache:{cache-name}:{cache-key}` ここで、 `cache-key` はアプリケーションが使用するキーで、 `cache:{cache-name}` はプレフィックスです。

source: the SmallRye GraphQL Client extension (`quarkus-smallrye-graphql-client`),
ja_jp: SmallRye GraphQL Client エクステンション(`quarkus-smallrye-graphql-client`),

source: the Spring Cloud Config client extension (`quarkus-spring-cloud-config-client`),
ja_jp: Spring Cloud Config client エクステンション(`quarkus-spring-cloud-config-client`),

source: the Vault extension (`quarkus-vault`),
ja_jp: Vault エクステンション(`quarkus-vault`),

source: the Vert.x Web Client
ja_jp: Vert.x Webクライアント

source: the Vert.x event bus
ja_jp: Vert.x イベントバス

source: the _low-level_ Mutiny variant of the Vert.x API: Unlike the previous one, it exposes a Mutiny API and provides both reactive and imperative methods (suffixed with `andAwait()`). Two APIs are exposed: `io.vertx.mutiny.redis.client.Redis` and `io.vertx.mutiny.redis.client.RedisAPI`. You will generally use the latter, except if you need to manage connections yourself.
ja_jp: Vert.x API の _低レベルの_ Mutiny バリアント :以前のものとは異なり、Mutiny API を公開し、リアクティブ型と命令型の両方のメソッド (接尾辞は `andAwait()`) が提供されます。2 つの API (`io.vertx.mutiny.redis.client.Redis` および `io.vertx.mutiny.redis.client.RedisAPI`) が公開されています。自分で接続を管理する必要がある場合を除いて、通常は後者を使用します。

source: the _low-level_ Vert.x client: it's a fully reactive, non-blocking, and asynchronous client. More details on https://vertx.io/docs/vertx-redis-client/java/[the Vert.x Redis Client documentation]. Two APIs are exposed: `io.vertx.redis.client.Redis`, and `io.vertx.redis.client.RedisAPI`. You will generally use the latter, except if you need to manage connections yourself.
ja_jp: _低レベルの_ Vert.x クライアント: 完全にリアクティブで、ノンブロッキングかつ非同期なクライアントです。詳細は https://vertx.io/docs/vertx-redis-client/java/[Vert.x Redis クライアントドキュメント] を参照してください。2 つの API (`io.vertx.redis.client.Redis` および `io.vertx.redis.client.RedisAPI`) が公開されています。接続を自分で管理する必要がある場合を除き、通常は後者を利用することになります。

source: the `ClientMultipartForm` can be created easily as follows:
ja_jp: `ClientMultipartForm` は次のように簡単に作成できます。

source: the `Content-Type` header is not set.
ja_jp: `Content-Type` ヘッダーが設定されていない。

source: the `Content-Type` header is set and the value is a compressed media type as configured via `quarkus.http.compress-media-types`.
ja_jp: `Content-Type` ヘッダーが設定されており、その値は `quarkus.http.compress-media-types` を介して設定された圧縮メディアタイプである。

source: the `amqp-host` or `amqp-port` are configured
ja_jp: `amqp-host` または `amqp-port` が設定されている場合

source: the `amqp-host` or `amqp-port` is configured
ja_jp: `amqp-host` または `amqp-port` が設定されている場合

source: the `api-server-url` is configured
ja_jp: `api-server-url` が設定されている場合

source: the `artifactId` of the descriptor artifact should be the `artifactId` of the corresponding Quarkus Platform BOM with the `-quarkus-platform-descriptor` suffix;
ja_jp: ディスクリプタアーティファクトの `artifactId` は、対応するQuarkus Platform BOMの `artifactId` で、サフィックスが `-quarkus-platform-descriptor` である必要があります。

source: the `artifactId` of the platform BOM
ja_jp: プラットフォーム BOM の `artifactId`

source: the `artifactId` of the properties artifact should be the `artifactId` of the corresponding Quarkus Platform BOM with the `-quarkus-platform-properties` suffix;
ja_jp: プロパティアーティファクトの `artifactId` は、対応するQuarkus Platform BOMの `artifactId` で、サフィックスが `-quarkus-platform-properties` である必要があります。

source: the `classifier` of the descriptor artifact should be left empty/null;
ja_jp: ディスクリプタアーティファクトの `classifier` は空/NULL のままの必要があります。
